//p381 q3

class A
{
    A(){
        System.out.println("Aの引数0のコンストラクタだよ");
    }
    A(int a)
    {
        System.out.println("Aの引数1のコンストラクタだよ");
    }
}
class B extends A
{
    B(){
        System.out.println("Bの引数0のコンストラクタだよ");
    }
    B(int b)
    {
        super(b);
        System.out.println("Bの引数1のコンストラクタだよ");
    }
}
class Sample1
{
    public static void main(String[] args)
    {
        B b1 = new B();
        B b2 = new B(10);
    }
}

/*
・サブクラスのコンストラクタが動くと勝手にスーパークラスのコンストラクタも動かされる。
・Aがコンストラクタなかった場合、勝手にAでA()が作られる。
・Bに引数があって、Aは引数梨のコンストラクタのみだった場合、自動的にBの中でsuper();の支持が作られるため、Aのコンストラクタも動く。

・AもBもコンストラクタを持っている場合！！！！
Aに引数有りコンストラクタがあると、Aから引数梨コンストラクタが消えてしまうルールがある。だから、Bのほうでsuper（値）を
手書きしないとエラーになる。

親が引数２、子が引数1のみだった場合。
子で引数を親の分ももらうか、子のほうで勝手に数字をあげちゃうのがいい。もし親が引数梨コンストラクタを持っていたら、ないほうが優先されるから大丈夫
 */